Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Use set Attributes(_: of Item At Path:) instead.
ja: set Attributes(_: of Item At Path:)を代わりに使ってください。

source: Use symbolic Link Destination URL instead.
ja: symbolic Link Destination URLを代わりに使ってください。

source: Use init(named:) for that purpose.
ja: init(named:)をその目的のために使ってください。

source: Use Distributed Objects Programming Topics or the NSObject method perform Selector(on Main Thread: with: wait Until Done:), instead.
ja: 代わりにDistributed Objects Programming TopicsまたはNSObjectのメソッドperform Selector(on Main Thread: with: wait Until Done:)を使ってください。

source: Use free.
ja: freeを使います。

source: Use munmap.
ja: munmapを使います。

source: Use Host objects to get the current host’s names and addresses and to look up other hosts by name or by address.
ja: Hostオブジェクトを使って、現在のホストの持つ名前とアドレスを手に入れてください、そして他のホストを名前によってまたはアドレスによって捜してください。

source: Use Swift’s expressive type system to avoid manually looping over collections of identically structured objects.
ja: Swiftの表現に富む型システムを使って、識別可能に構造化されたオブジェクトのコレクションすべてにわたって手動で見ていくことを回避してください。

source: Use Unicode TR#29 to specify word boundaries (otherwise, traditional regular expression word boundaries are used).
ja: 語境界を指定するために、Unicode TR#29を使います（一方そうしなければ、従来の正規表現語境界が使われます）。

source: Use a date components formatter to create strings for your app’s interface.
ja: 日付構成要素フォーマッタを使ってあなたのアプリのインターフェイスに文字列を作成してください。

source: Use a date interval formatter to create user-readable strings of the form <start> - <end> for your app’s interface, where <start> and <end> are date values that you supply.
ja: 日付間隔フォーマッタを使って、形式<start> - <end>のユーザが読むことができる文字列を作成してください、そこで<start> and <end>はあなたが提供する日付値です。

source: Use arrays, dictionaries, sets, and specialized collections to store and iterate groups of objects or values.
ja: 配列、辞書、集合、そして特殊化されたコレクションを使って、オブジェクトや値からなるグループを格納したり反復処理します。

source: Use bridged reference types when you need reference semantics or Foundation-specific behavior.
ja: ブリッジされた参照型を、あなたが参照意味論またはFoundation特有の挙動を必要とする場合に使ってください。

source: Use date values in conjunction with Date Formatter instances to create localized representations of dates and times and with Calendar instances to perform calendar arithmetic.
ja: 日付値を使って、Date Formatterインスタンスと連携して日付と時刻のローカライズされた表現を作成したり、Calendarインスタンスとともにカレンダー計算を実行してください。

source: Use low-level Unix features to manage input and output among files, processes, and the network.
ja: ローレベルUnix機能を使って、ファイル、プロセス、およびネットーワーク間の入出力を管理します。

source: Use of this method is preferred over other access methods because it returns the localized value of a key when one is available.
ja: このメソッドの使用は、それがあるキーのローカライズされた値をそれが利用可能な場合に返すことから、他のアクセスメソッドより優先されます。

source: Use other system APIs to interact with the resource.
ja: 他のシステムのAPIを使ってリソースと相互作用する。

source: Use predicates, expressions, and sort descriptors to examine elements in collections and other services.
ja: 述語、式、そしてソート記述子を使って、コレクションおよび他の提供での要素を吟味します。

source: Use the file Wrappers property to get the file wrappers of the nodes contained by the directory.
ja: file Wrappersプロパティを使って、ディレクトリによって含まれるそれらノードのファイルラッパーを得てください。

source: Use the int16Value method to retrieve the integer value for the permissions.
ja: int16Valueメソッドを使って権限に対する整数値を取って来てください。

source: Use the lazy property when chaining operations to prevent intermediate operations from allocating storage, or when you only need a part of the final collection to avoid unnecessary computation.
ja: 演算を連鎖することで中間演算がストレージを割り当てるのを防ぐときに、またはあなたが最終的コレクションの一部を必要とするだけであって不必要な計算を避けたい場合に、lazyプロパティを使ってください。

source: Use the read Data To End Of File() or read Data(of Length:) methods to read data from it.
ja: read Data To End Of File()またはread Data(of Length:)メソッドを使ってデータをそれから読み込んでください。

source: Use the reduce(_: _:) method to produce a single value from the elements of an entire sequence.
ja: reduce(_: _:)メソッドを使って、あるシーケンス全体の中の要素から単一の値を生成してください。

source: Use the reduce(into: _:) method to produce a single value from the elements of an entire sequence.
ja: reduce(into: _:)メソッドを使って、あるシーケンス全体の要素から単一の値を生成してください。

source: Use the write(_:) method to write data to the file handle.
ja: write(_:)メソッドを使ってファイルハンドルへとデータを書き出してください。

source: Use the attributes default dictionary to reset the attributes of the string when a change in value warrants it (for example, a negative value becomes positive) For information on creating attributed strings, see Attributed String Programming Guide.
ja: attributes初期状態辞書を使って、それを要する変更が値にある（例えば、負の値が正になる）場合は、文字列の属性を規定値に戻してください。属性付き文字列の作成に関する情報として、Attributed String Programming Guideを見てください。

source: Use the NSFile Wrapper Reading Immediate reading option to reduce the likelihood of that problem.
ja: NSFile Wrapper Reading Immediate読み出しオプションを使って、問題の可能性を減少させてください。

source: Use the NSFile Wrapper Writing With Name Updating writing option to increase the likelihood of that.
ja: NSFile Wrapper Writing With Name Updating書き出しオプションを使って、その可能性を増大させてください。

source: Use the class name explicitly when getting a class version number:
ja: クラスバージョン数を取得する時はクラス名を明示的に使ってください：

source: Use the closed range operator (...) to create a closed range of any type that conforms to the Comparable protocol.
ja: 完結範囲演算子（...）を使うことでComparableプロトコルに準拠する何らかの型の配列を作成してください。

source: Use the desired service’s name to get the NSFile Provider Service object for the service.
ja: 求めるサービスの持つ名前を使って、そのサービスのためのNSFile Provider Serviceオブジェクトを得てください。

source: Use the half-open range operator (..<) to create a range of any type that conforms to the Comparable protocol.
ja: 半開範囲演算子（..<）を使ってComparableプロトコルに準拠する何らかの型の範囲を作成します。

source: Use the iCloud key-value store to make preference, configuration, and app-state data available to every instance of your app on every device connected to a user’s iCloud account.
ja: iCloud「キー値」保管を使って、初期設定、機器構成、そしてアプリ状態データをあるユーザのiCloudアカウントに接続されたあらゆるデバイス上のあなたのアプリのあらゆるインスタンスで利用可能にしてください。

source: Use the methods of the bundle object to locate or load the needed resource.
ja: バンドルオブジェクトのメソッドを使用して、必要なリソースを発見したりロードする。

source: Use the postfix range operator (postfix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 後置完結範囲演算子（後置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix closed range operator (prefix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置完結範囲演算子（前置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix half-open range operator (prefix ..<) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置半開範囲演算子（前置..<）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the returned services to perform custom actions defined by the services’ protocol.
ja: 返されるサービスを使って、サービスの持つプロトコルによって定義されるあつらえのアクションを実行してください。

source: Use the techniques described in this sample to handle the differences between external JSON data and your app’s model types.
ja: このサンプルで記述されるテクニックを使って、外部JSONデータとあなたのアプリの持つモデル型の間の相違点を取り扱ってください。

source: Use this class to create ISO 8601 representations of dates and create dates from text strings in ISO 8601 format.
ja: このクラスを使って日付のISO 8601表現を作成してください、そしてISO 8601形式でのテキスト文字列から日付を作成してください。

source: Use this convenience method to format a string using the default formatter values, with the exception of the units Style value.
ja: この便宜メソッドを使って、units Style値を除いて、省略時のフォーマッタ値を使って文字列を書式設定してください。

source: Use this in Save To operations.
ja: これを「Save To」操作で使ってください。

source: Use this in Save or Save As operations.
ja: これを「保存」または「別名で保存」操作で使ってください。

source: Use this initializer to create a new set from an existing sequence, like an array or a range:
ja: このイニシャライザを使って、新しい集合を既存のシーケンス、配列またはある範囲などから作成してください：

source: Use this method if your code calls system routines that expect C-string path arguments.
ja: C文字列パス引数を期待するシステムルーチンをあなたのコードが呼び出すならば、このメソッドを使ってください。

source: Use this method if your code receives paths as C strings from system routines.
ja: このメソッドを、あなたのコードがパスをC文字列としてシステムルーチンから受け取るならば使ってください。

source: Use this method to add an existing file wrapper as a child of a directory file wrapper.
ja: このメソッドを使って、既存のファイルラッパーをディレクトリファイルラッパーの子として加えてください。

source: Use this method to ask the class object for the implementation of instance methods only.
ja: インスタンスメソッドの実装についてクラスオブジェクトに尋ねるためにだけこのメソッドを使用してください。

source: Use this method to create hard links between files in the current file system.
ja: このメソッドを使ってハードリンクをファイル間に現在のファイルシステムにおいて作成してください。

source: Use this method to determine the relationship between an item and a directory whose location you already know.
ja: このメソッドを使って、ある項目とそれの位置をあなたがすでに知っているディレクトリとの間の関係を決定してください。

source: Use this method to determine the relationship between an item and one of the system-specific directories.
ja: このメソッドを使って、ある項目とシステム固有ディレクトリの１つと間の関係を決定してください。

source: Use this method to format date information that is already broken down into the component day and time values.
ja: 既に構成要素の日にちと時間値へと分解される日付情報を、このメソッドを使って書式設定してください。

source: Use this method to move a file from its current location to iCloud.
ja: このメソッドを使ってファイルをそれの現在の場所からiCloudへ移動してください。

source: Use this method to receive an array of nonoptional values when your transformation produces an optional value.
ja: あなたの変換がオプショナル値を生成する場合に、このメソッドを使って非オプショナル値からなる配列を受け取ってください。

source: Use this parameter to specify whether you want to the resulting string to use an abbreviated or more spelled out format.
ja: このパラメータを使って、あなたが結果文字列に望むのは省略されたかまたはより詳細に綴られた書式設定かを指定してください。

source: Use this property to limit the number of units displayed in the resulting string.
ja: このプロパティを使って、結果文字列で表示される単位の数を制限してください。

source: Use this property to specify whether you want abbreviated or shortened versions of unit names—for example, hrs instead of hours.
ja: このプロパティを使って、あなたが単位名の省略または短縮版のどちらを望むのかを指定してください — 例えばhrsをhoursの代わりに。

source: Use this property when you are constrained for space or want to round up values to the nearest large unit.
ja: あなたが空間的に窮屈であるまたは値を最も近い大きな単位に切り上げたい場合に、このプロパティを使ってください。

source: Use this string to specify a custom fixed format for each of the date and time values.
ja: この文字列を使って、あつらえの固定された書式設定を、日付と時刻値の各々に指定してください。

source: Use this style when you do not want to include date or time information in the resulting string.
ja: あなたが日付または時刻情報を結果文字列において含めたくない場合は、このスタイルを使ってください。

source: Used as input to the search algorithm for finding a corresponding date.
ja: 一致する日付を見つけるために検索アルゴリズムへの入力として使われます。

source: Used by the method enumerate Matches(in: options: range: using:).
ja: メソッドenumerate Matches(in: options: range: using:)によって使われます。

source: Used to perform template substitution for a single result for clients implementing their own replace functionality.
ja: クライアントが実装した彼ら独自の置換機能の結果文字列に対してテンプレート置換を実行するために使用されます。

source: Used when finished with an enumerator.
ja: ある列挙子で終了した時に使われます。

source: User home directories (/Users).
ja: ユーザホームディレクトリ（/Users）。

source: User-Relevant Errors
ja: ユーザ関連のエラー

source: Uses type info from the class description and NSScript Coercion Handler to attempt to convert value for key to the proper type, if necessary.
ja: クラス記述とNSScript Coercion Handlerからの型情報を使って、value for keyの適切な型への変換を、必要ならば試みます。

source: Using JSON with Custom Types
ja: JSONをあつらえの型で使う

source: Using Reference Types
ja: 参照型を使用する

source: Using Streams
ja: ストリームを使う

source: Using the for Each method is distinct from a for-in loop in two important ways:
ja: for Eachメソッドを使うことは、for-inループとは２つの重要なやり方においてまるで異なります：

source: Using the prefix(through:) method is equivalent to using a partial closed range as the collection’s subscript.
ja: prefix(through:)メソッドを使うことは、部分的な完結範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the prefix(up To:) method is equivalent to using a partial half-open range as the collection’s subscript.
ja: prefix(up To:)メソッドを使うことは、部分的な半開範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the return statement in the body closure will exit only from the current call to body, not from any outer scope, and won’t skip subsequent calls.
ja: return文をbodyクロージャにおいて使うことは、ただ現在のbodyへの呼び出しから抜け出すだけです、全く外側のスコープからではなくて、そして続いて起こる呼び出しを飛ばしません。

source: Using the suffix(from:) method is equivalent to using a partial range from the index as the collection’s subscript.
ja: suffix(from:)メソッドを使うことは、インデックスからの部分的範囲をコレクションのもつ添え字として使うことと同等です。

source: Using this map table on the new array, you can get a first guess for the indexes, and then sort that.
ja: このマップを新しい配列上で使用して、あなたはそれらインデックスに対する最初の推測を得て、それからそれをソートすることができます。

source: Using this property yields more correct phrasing than simply prepending the string “About” to an output string.
ja: このプロパティを使うことは、単純に文字列 “About” を出力文字列の前に加えるよりももっと正確な言い回しを生み出します。

source: Validating Partial Strings
ja: 部分的な文字列を検証する

source: Validating a Date
ja: 日付を検証する

source: Values representing alignment operations.
ja: 調整演算を表しているさまざまな値。

source: Various user-visible documentation, support, and configuration files (/Library).
ja: 様々なユーザが見ることができる書類、サポート、そして構成設定ファイル（/Library）。

source: Version 0 maps to “old-style” Netscape cookies.
ja: バージョン 0 は、 “old-style” Netscape クッキーと関連付けます。

source: Version 0: This version refers to “traditional” or “old-style” cookies, the original cookie format defined by Netscape.
ja: バージョン 0: このバージョンは “traditional” または “old-style” クッキー、Netscapeによって定義される元々のクッキー形式を参照します。

source: Version 1 maps to RFC 2965 cookies.
ja: バージョン 1 は、 RFC 2965 クッキーと関連付けます。

source: Version 1: This version refers to cookies as defined in RFC 2965, HTTP State Management Mechanism.
ja: バージョン 1: このバージョンは、RFC 2965、HTTP State Management Mechanismにおいて定義されるクッキーを参照します。

source: Version numbers are needed for decoding or unarchiving, so older versions of an object can be detected and decoded correctly.
ja: バージョン数は、デコードまたはアンアーカイブのために必要とされます、それで古いバージョンのオブジェクトは削除されて、正しくデコードされることができます。

source: Warning
ja: 警告

source: Week of Year
ja: 年内週番号

source: Week of Year with Ordinal Weekday
ja: 年内週番号と曜日番号

source: Weekday ordinal units represent the position of the weekday within the next larger calendar unit, such as the month.
ja: 曜日序数単位は、次のより大きいカレンダー単位、例えば月などの内部の曜日の位置を表します。

source: What follows are a set of graduated examples for using the NSRegular Expression class.
ja: 以下のものは、NSRegular Expressionクラスを使用するひとつの段階的な例です。

source: When false, the receiver delivers notifications to their observers according to the suspended-notification behavior specified in the corresponding dispatch table entry.
ja: falseの場合、レシーバは通知をそれのオブザーバに配達します、対応するディスパッチテーブル登録項目において指定される待機通知挙動に従います。

source: When letters .reduce(into: _:) is called, the following steps occur:
ja: letters .reduce(into: _:)が呼び出される時、以下の段階が生じます：

source: When nil, the notification center doesn’t use a notification’s name to decide whether to deliver it to the observer.
ja: nilの場合、通知センターは通知の名前を、それをオブザーバに配達するかどうか決定するために使いません。

source: When nil, the notification center doesn’t use a notification’s sender to decide whether to deliver it to the observer.
ja: nilの場合、通知センターは通知の送り手を、それをオブザーバに配達するかどうか決定するために使いません。

source: When nil, the receiver does not use notification names as criteria for removal.
ja: nilの場合、レシーバは通知名を削除の基準として使いません。

source: When nil, the receiver does not use notification observers as criteria for removal.
ja: nilの場合、レシーバは通知オブザーバを削除の基準として使いません。

source: When nil, the receiver does not use notification senders as criteria for removal.
ja: nilの場合、レシーバは通知の送り手を削除の基準として使いません。

source: When numbers .reduce(_: _:) is called, the following steps occur:
ja: numbers .reduce(_: _:)が呼び出される時、以下の段階が生じます：

source: When true, the receiver delivers the notification immediately to its observers.
ja: trueの場合、レシーバは通知をすぐにそれのオブザーバに配達します。

source: When a global version of a resource exists, language-specific versions are never returned.
ja: あるリソースのグローバル版が存在する場合、言語特有版は、決して返されません。

source: When a new instance of Date Components is created, the date components are set to nil.
ja: Date Componentsの新しいインスタンスが作成される場合、日付構成要素それらはnilに設定されます。

source: When a notification with this suspension behavior is matched, it has the effect of first flushing any queued notifications.
ja: この待機挙動を持つ通知が合致する場合、それは待ち行列に入れられたあらゆる通知をまず一掃する効果を持ちます。

source: When an Apple event reaches a Cocoa application, Cocoa’s built-in scripting support transforms it into a script command (that is, an instance of NSScript Command or one of the subclasses provided by Cocoa scripting or by your application) and executes the command in the context of the application.
ja: あるアップルイベントがCocoaアプリケーションに届く時、Cocoaの組込みスクリプティングサポートはそれをスクリプトコマンド（すなわち、NSScript CommandまたはCocoaスクリプティングやあなたのアプリケーションによって提供されるサブクラスの１つのインスタンス）に変換して、そのコマンドをそのアプリケーションの文脈において実行します。

source: When an app is launched, this property is initially set to the app’s current working directory.
ja: アプリが起動される時、このプロパティは初めにアプリの持つ現在の作業ディレクトリに設定されます。

source: When an object is sent a message for which it has no corresponding method, the runtime system gives the receiver an opportunity to delegate the message to another receiver.
ja: あるオブジェクトが、それが対応するメソッドを持たないメッセージを送られる場合、ランタイムシステムは、メッセージを別のレシーバに委任する機会をそのレシーバに与えます。

source: When assigning a delegate to this property, your object must conform to the File Manager Delegate protocol.
ja: 委任先をこのプロパティに割り当てる場合、あなたのオブジェクトはFile Manager Delegateプロトコルに準拠しなければなりません。

source: When copying items, the current process must have permission to read the file or directory at src Path and write the parent directory of dst Path.
ja: 項目をコピーする場合、現在のプロセスはsrc Pathでのファイルまたはディレクトリを読み込む、そしてdst Pathの親ディレクトリに書き出す権限を持たなければなりません。

source: When copying items, the current process must have permission to read the file or directory at src URL and write the parent directory of dst URL.
ja: 項目をコピーする場合、現在のプロセスはsrc URLでのファイルまたはディレクトリを読み込む、そしてdst URLの親ディレクトリに書き出す権限を持たなければなりません。

source: When creating a temporary directory, this parameter is ignored and the directory is always created.
ja: 一時ディレクトリを作成する場合、このパラメータは無視されます、そしてディレクトリは常に作成されます。

source: When days, hours, minutes, and seconds are allowed, the value is displayed as “0d 1:00:00” using the positional style, and as “0d 1h 0m 0s” using the abbreviated style.
ja: 日、時、分、そして秒が認められる場合、この値は、位置のスタイルを使って “0d 1:00:00” のように、そして省略のスタイルを使って “0d 1h 0m 0s” のように表示されます

source: When displaying a date to a user, you set the date Style and time Style properties of the date formatter according to your particular needs.
ja: 日付をユーザに表示する場合、あなたは日付フォーマッタのdate Styleとtime Styleプロパティをあなたの特定の必要に応じて設定します。

source: When executing more than one block, the operation itself is considered finished only when all blocks have finished executing.
ja: ひとつ以上のブロックを実行する時、それ自体のオペレーションが完了したとみなされるのはただ全てのブロックが実行を完了した時のみです。

source: When garbage collection is enabled, this method is invoked instead of dealloc.
ja: ガベージコレクションが可能にされる場合、このメソッドはdeallocの代わりに発動されます。

source: When iCloud is currently available, this property contains an opaque object representing the identity of the current user.
ja: iCloudが現在利用可能ならば、このプロパティは現在のユーザの身元を表している不透明オブジェクトを含みます。

source: When implementing a subclass, override this method only when the string that users see and the string that they edit are different.
ja: サブクラスを実装する場合、ユーザが見る文字列と彼らが編集する文字列とが異なる場合にのみ、このメソッドをオーバーライドしてください。

source: When implementing a subclass, return an NSAttributed String object if the string for display should have some attributes.
ja: サブクラスを実装する場合、表示用文字列がいくつかの属性を持つべきならば、NSAttributed Stringオブジェクトを返してください。

source: When implementing a subclass, return the NSString object that textually represents the cell’s object for display and—if editing String(for:) is unimplemented—for editing.
ja: サブクラスを実装する場合、NSStringオブジェクトを返してください、それはセルの持つオブジェクトを表示用にそして — editing String(for:)が実装されないならば — 編集用に、テキスト的に表すものです。

source: When implementing a subclass, you should return a unit converter that returns the inputted value for both the base Unit Value From Value: and value From Base Unit Value: methods.
ja: サブクラスを実装する場合、あなたはbase Unit Value From Value:とvalue From Base Unit Value:メソッドの両方に対する入力値を返す、ある単位コンバータを返すべきです。

source: When implementing this method in a subclass, return by reference the object an Object created from string.
ja: このメソッドをサブクラスに実装する場合、stringから作成されるan Objectオブジェクトを参照することによって返してください。

source: When invoked, an assertion handler prints an error message that includes the method and class (or function) containing the assertion and raises an NSInternal Inconsistency Exception.
ja: 発動される場合、あるアサーションハンドラは、アサーションを含んでいるメソッドとクラス（または関数）を含んでいるエラーメッセージを出力します、そしてNSInternal Inconsistency Exceptionを起こします。

source: When it does allocate the initial memory, though, it allocates the specified amount.
ja: それが初期メモリをアロケートする場合、そうはいっても、それは指定された量をアロケートします。

source: When locating resource files, the bundle object automatically considers many standard filename modifiers when determining which file to return.
ja: リソースファイルを捜し出す場合、バンドルオブジェクトは、どのファイルを返すか判断する時に自動的に多くの標準ファイル名修飾子を考慮します。

source: When looking for resources, you provide the name of the resource and its type at a minimum.
ja: リソースを見つける時、あなたは最低限リソースの名前とそれの型を提供します。

source: When moving items, the current process must have permission to read the item at src Path and write the parent directory of dst Path.
ja: 項目を移動する場合、現在のプロセスはsrc Pathでの項目を読み込む、そしてdst Pathの親ディレクトリに書き出す権限を持たなければなりません。

source: When moving items, the current process must have permission to read the item at src URL and write the parent directory of dst URL.
ja: 項目を移動する場合、現在のプロセスはsrc URLでの項目を読み込む、そしてdst URLの親ディレクトリに書き出す権限を持たなければなりません。

source: When not set, allows the normal suspension behavior of notification observers to take place.
ja: 設定される場合、通知オブザーバの通常の待機挙動を発生させます。

source: When not set, the notification is sent only to applications within the same login session as the posting task.
ja: 設定される場合、通知は投函タスクと同じログインセッション内部のアプリケーションにのみ送られます。

source: When not using ARC, your implementation of dealloc must invoke the superclass’s implementation as its last instruction.
ja: ARCを使っていない場合、あなたのdeallocの実装は、スーパークラスの実装をそれの最後の命令として発動しなければなりません。

source: When reading a directory, children are added and removed as necessary to match the file system.
ja: ディレクトリを読み出す場合、子らはファイルシステムに合致するよう必要に応じて追加および除去されます。

source: When reading a file, your handler block is typically executed repeatedly until the entire contents of the file have been read.
ja: ファイルを読み込む場合、あなたのハンドラブロックはたいてい、ファイルの内容全体が読み込まれてしまうまで繰り返して実行されます。

source: When reading data from a socket, your handler block is executed whenever there is data on the socket waiting to be read.
ja: ソケットからデータを読み込む場合、読み込まれるのを待っているデータがソケット上にある時はいつでも、あなたのハンドラブロックは実行されます。

source: When set, the notification is delivered immediately to all observers, regardless of their suspension behavior or suspension state.
ja: 設定される場合、通知は直ぐに全てのオブザーバに配達されます、それらの待機挙動または待機状態に関係なく。

source: When set, the notification is posted to all sessions.
ja: 設定される場合、通知は全てのセッションに投函されます。

source: When several classes are linked into a dynamically loadable file, the default principal class is the first one listed on the ld command line.
ja: 幾つかのクラスがひとつの動的なロード可能ファイルへとリンクされるならば、省略時のプリンシパルクラスはldコマンドライン上でリストされる最初のものです。

source: When specifying the location of files, you can use either NSURL or NSString objects.
ja: ファイルの位置を指定する場合、あなたはNSURLまたはNSStringオブジェクトのどちらかを使用できます。

source: When the NSEnumeration Concurrent enumeration option is specified, enumeration stops after all of the currently running blocks finish.
ja: NSEnumeration Concurrent列挙オプションが指定される場合、列挙は、現在実行しているいくつかのブロックすべてが完了後に停止します。

source: When the data becomes available, this method posts a NSFile Handle Data Available notification on the current thread.
ja: データが利用可能になる場合、このメソッドはNSFile Handle Data Available通知を現在のスレッド上で投函します。

source: When the item is replaced, this pointer is set to the URL of the new item.
ja: 項目が置き換えられた場合、このポインタは新しい項目のURLに設定されます。

source: When the result is true, set
ja: 結果がtrueがある場合、設定されます

source: When the return value is false, the value of i is equal to limit.
ja: 戻り値がfalseの場合、iの値はlimitに等しいです。
